TexasInstruments/mspm0-sdk/source/ti/devices/msp/peripherals/hw_adc12.h
                                                                                    this bit, or when the corresponding
                                                                                    bit in ICLR is set to 1 */
#define ADC12_DMA_TRIG_ICLR_MEMRESIFG20_NO_EFFECT ((uint32_t)0x00000000U)         /* !< No new data ready. */
#define ADC12_DMA_TRIG_ICLR_MEMRESIFG20_CLR      ((uint32_t)0x10000000U)         /* !< A new data is ready to be read. */
/* ADC12_DMA_TRIG_ICLR[MEMRESIFG22] Bits */
#define ADC12_DMA_TRIG_ICLR_MEMRESIFG22_OFS      (30)                            /* !< MEMRESIFG22 Offset */
#define ADC12_DMA_TRIG_ICLR_MEMRESIFG22_MASK     ((uint32_t)0x40000000U)         /* !< Raw interrupt status for MEMRES22.
                                                                                    This bit is set to 1 when MEMRES22 is
                                                                                    loaded with a new conversion result.
                                                                                    Reading MEMRES22 register will clear
                                                                                    this bit, or when the corresponding
                                                                                    bit in ICLR is set to 1 */
#define ADC12_DMA_TRIG_ICLR_MEMRESIFG22_NO_EFFECT ((uint32_t)0x00000000U)         /* !< No new data ready. */
#define ADC12_DMA_TRIG_ICLR_MEMRESIFG22_CLR      ((uint32_t)0x40000000U)         /* !< A new data is ready to be read. */
/* ADC12_DMA_TRIG_ICLR[MEMRESIFG23] Bits */
#define ADC12_DMA_TRIG_ICLR_MEMRESIFG23_OFS      (31)                            /* !< MEMRESIFG23 Offset */
#define ADC12_DMA_TRIG_ICLR_MEMRESIFG23_MASK     ((uint32_t)0x80000000U)         /* !< Raw interrupt status for MEMRES23.
                                                                                    This bit is set to 1 when MEMRES23 is
                                                                                    loaded with a new conversion result.
                                                                                    Reading MEMRES23 register will clear
                                                                                    this bit, or when the corresponding
                                                                                    bit in ICLR is set to 1 */
#define ADC12_DMA_TRIG_ICLR_MEMRESIFG23_NO_EFFECT ((uint32_t)0x00000000U)         /* !< No new data ready. */
#define ADC12_DMA_TRIG_ICLR_MEMRESIFG23_CLR      ((uint32_t)0x80000000U)         /* !< A new data is ready to be read. */
/* ADC12_DMA_TRIG_ICLR[MEMRESIFG8] Bits */
#define ADC12_DMA_TRIG_ICLR_MEMRESIFG8_OFS       (16)                            /* !< MEMRESIFG8 Offset */
#define ADC12_DMA_TRIG_ICLR_MEMRESIFG8_MASK      ((uint32_t)0x00010000U)         /* !< Raw interrupt status for MEMRES8.
                                                                                    This bit is set to 1 when MEMRES8 is
                                                                                    loaded with a new conversion result.
                                                                                    Reading MEMRES8 register will clear
                                                                                    this bit, or when the corresponding
                                                                                    bit in ICLR is set to 1 */
#define ADC12_DMA_TRIG_ICLR_MEMRESIFG8_NO_EFFECT ((uint32_t)0x00000000U)         /* !< No new data ready. */
#define ADC12_DMA_TRIG_ICLR_MEMRESIFG8_CLR       ((uint32_t)0x00010000U)         /* !< A new data is ready to be read. */
/* ADC12_DMA_TRIG_ICLR[MEMRESIFG21] Bits */
#define ADC12_DMA_TRIG_ICLR_MEMRESIFG21_OFS      (29)                            /* !< MEMRESIFG21 Offset */
#define ADC12_DMA_TRIG_ICLR_MEMRESIFG21_MASK     ((uint32_t)0x20000000U)         /* !< Raw interrupt status for MEMRES21.
                                                                                    This bit is set to 1 when MEMRES21 is
                                                                                    loaded with a new conversion result.
                                                                                    Reading MEMRES21 register will clear
                                                                                    this bit, or when the corresponding
                                                                                    bit in ICLR is set to 1 */
#define ADC12_DMA_TRIG_ICLR_MEMRESIFG21_NO_EFFECT ((uint32_t)0x00000000U)         /* !< No new data ready. */
#define ADC12_DMA_TRIG_ICLR_MEMRESIFG21_CLR      ((uint32_t)0x20000000U)         /* !< A new data is ready to be read. */

/* ADC12_GEN_EVENT_IIDX Bits */
/* ADC12_GEN_EVENT_IIDX[STAT] Bits */
#define ADC12_GEN_EVENT_IIDX_STAT_OFS            (0)                             /* !< STAT Offset */
#define ADC12_GEN_EVENT_IIDX_STAT_MASK           ((uint32_t)0x000003FFU)         /* !< Interrupt index status */
#define ADC12_GEN_EVENT_IIDX_STAT_NO_INTR        ((uint32_t)0x00000000U)         /* !< No bit is set means there is no
                                                                                    pending interrupt request */
#define ADC12_GEN_EVENT_IIDX_STAT_HIGHIFG        ((uint32_t)0x00000003U)         /* !< High threshold compare interrupt */
#define ADC12_GEN_EVENT_IIDX_STAT_LOWIFG         ((uint32_t)0x00000004U)         /* !< Low threshold compare interrupt */
#define ADC12_GEN_EVENT_IIDX_STAT_INIFG          ((uint32_t)0x00000005U)         /* !< Primary Sequence In range
                                                                                    comparator interrupt */
#define ADC12_GEN_EVENT_IIDX_STAT_MEMRESIFG0     ((uint32_t)0x00000009U)         /* !< MEMRES0 data loaded interrupt */

/* ADC12_GEN_EVENT_IMASK Bits */
/* ADC12_GEN_EVENT_IMASK[INIFG] Bits */
#define ADC12_GEN_EVENT_IMASK_INIFG_OFS          (4)                             /* !< INIFG Offset */
#define ADC12_GEN_EVENT_IMASK_INIFG_MASK         ((uint32_t)0x00000010U)         /* !< Mask INIFG in MIS_EX register. */
#define ADC12_GEN_EVENT_IMASK_INIFG_CLR          ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define ADC12_GEN_EVENT_IMASK_INIFG_SET          ((uint32_t)0x00000010U)         /* !< Interrupt is pending. */
/* ADC12_GEN_EVENT_IMASK[LOWIFG] Bits */
#define ADC12_GEN_EVENT_IMASK_LOWIFG_OFS         (3)                             /* !< LOWIFG Offset */
#define ADC12_GEN_EVENT_IMASK_LOWIFG_MASK        ((uint32_t)0x00000008U)         /* !< Raw interrupt flag for the MEMRESx
                                                                                    result register being below than the
                                                                                    WCLOWx threshold of the window
                                                                                    comparator. This bit is reset to 0 by
                                                                                    IIDX read or when corresponding bit
                                                                                    in ICLR_EX is set to 1. */
#define ADC12_GEN_EVENT_IMASK_LOWIFG_CLR         ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define ADC12_GEN_EVENT_IMASK_LOWIFG_SET         ((uint32_t)0x00000008U)         /* !< Interrupt is pending. */
/* ADC12_GEN_EVENT_IMASK[HIGHIFG] Bits */
#define ADC12_GEN_EVENT_IMASK_HIGHIFG_OFS        (2)                             /* !< HIGHIFG Offset */
#define ADC12_GEN_EVENT_IMASK_HIGHIFG_MASK       ((uint32_t)0x00000004U)         /* !< Raw interrupt flag for the MEMRESx
                                                                                    result register being higher than the
                                                                                    WCHIGHx threshold of the window
                                                                                    comparator. This bit is reset to 0 by
                                                                                    IIDX read or when corresponding bit
                                                                                    in ICLR_EX is set to 1. */
#define ADC12_GEN_EVENT_IMASK_HIGHIFG_CLR        ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define ADC12_GEN_EVENT_IMASK_HIGHIFG_SET        ((uint32_t)0x00000004U)         /* !< Interrupt is pending. */
/* ADC12_GEN_EVENT_IMASK[MEMRESIFG0] Bits */
#define ADC12_GEN_EVENT_IMASK_MEMRESIFG0_OFS     (8)                             /* !< MEMRESIFG0 Offset */
#define ADC12_GEN_EVENT_IMASK_MEMRESIFG0_MASK    ((uint32_t)0x00000100U)         /* !< Raw interrupt status for MEMRES0.
                                                                                    This bit is set to 1 when MEMRES0 is
                                                                                    loaded with a new conversion result.
                                                                                    Reading MEMRES0 register will clear
                                                                                    this bit, or when the corresponding
                                                                                    bit in ICLR is set to 1 */
#define ADC12_GEN_EVENT_IMASK_MEMRESIFG0_CLR     ((uint32_t)0x00000000U)         /* !< No new data ready. */
#define ADC12_GEN_EVENT_IMASK_MEMRESIFG0_SET     ((uint32_t)0x00000100U)         /* !< A new data is ready to be read. */

/* ADC12_GEN_EVENT_RIS Bits */
/* ADC12_GEN_EVENT_RIS[INIFG] Bits */
#define ADC12_GEN_EVENT_RIS_INIFG_OFS            (4)                             /* !< INIFG Offset */
#define ADC12_GEN_EVENT_RIS_INIFG_MASK           ((uint32_t)0x00000010U)         /* !< Mask INIFG in MIS_EX register. */
#define ADC12_GEN_EVENT_RIS_INIFG_CLR            ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define ADC12_GEN_EVENT_RIS_INIFG_SET            ((uint32_t)0x00000010U)         /* !< Interrupt is pending. */
/* ADC12_GEN_EVENT_RIS[LOWIFG] Bits */
#define ADC12_GEN_EVENT_RIS_LOWIFG_OFS           (3)                             /* !< LOWIFG Offset */
#define ADC12_GEN_EVENT_RIS_LOWIFG_MASK          ((uint32_t)0x00000008U)         /* !< Raw interrupt flag for the MEMRESx
                                                                                    result register being below than the
                                                                                    WCLOWx threshold of the window
                                                                                    comparator. This bit is reset to 0 by
                                                                                    IIDX read or when corresponding bit
                                                                                    in ICLR_EX is set to 1. */
#define ADC12_GEN_EVENT_RIS_LOWIFG_CLR           ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define ADC12_GEN_EVENT_RIS_LOWIFG_SET           ((uint32_t)0x00000008U)         /* !< Interrupt is pending. */
/* ADC12_GEN_EVENT_RIS[HIGHIFG] Bits */
#define ADC12_GEN_EVENT_RIS_HIGHIFG_OFS          (2)                             /* !< HIGHIFG Offset */
#define ADC12_GEN_EVENT_RIS_HIGHIFG_MASK         ((uint32_t)0x00000004U)         /* !< Raw interrupt flag for the MEMRESx
                                                                                    result register being higher than the
                                                                                    WCHIGHx threshold of the window
                                                                                    comparator. This bit is reset to 0 by
                                                                                    IIDX read or when corresponding bit
                                                                                    in ICLR_EX is set to 1. */
#define ADC12_GEN_EVENT_RIS_HIGHIFG_CLR          ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define ADC12_GEN_EVENT_RIS_HIGHIFG_SET          ((uint32_t)0x00000004U)         /* !< Interrupt is pending. */
/* ADC12_GEN_EVENT_RIS[MEMRESIFG0] Bits */
#define ADC12_GEN_EVENT_RIS_MEMRESIFG0_OFS       (8)                             /* !< MEMRESIFG0 Offset */
#define ADC12_GEN_EVENT_RIS_MEMRESIFG0_MASK      ((uint32_t)0x00000100U)         /* !< Raw interrupt status for MEMRES0.
                                                                                    This bit is set to 1 when MEMRES0 is
                                                                                    loaded with a new conversion result.
                                                                                    Reading MEMRES0 register will clear
                                                                                    this bit, or when the corresponding
                                                                                    bit in ICLR is set to 1 */
#define ADC12_GEN_EVENT_RIS_MEMRESIFG0_CLR       ((uint32_t)0x00000000U)         /* !< No new data ready. */
#define ADC12_GEN_EVENT_RIS_MEMRESIFG0_SET       ((uint32_t)0x00000100U)         /* !< A new data is ready to be read. */

/* ADC12_GEN_EVENT_MIS Bits */
/* ADC12_GEN_EVENT_MIS[INIFG] Bits */
#define ADC12_GEN_EVENT_MIS_INIFG_OFS            (4)                             /* !< INIFG Offset */
#define ADC12_GEN_EVENT_MIS_INIFG_MASK           ((uint32_t)0x00000010U)         /* !< Mask INIFG in MIS_EX register. */
#define ADC12_GEN_EVENT_MIS_INIFG_CLR            ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define ADC12_GEN_EVENT_MIS_INIFG_SET            ((uint32_t)0x00000010U)         /* !< Interrupt is pending. */
/* ADC12_GEN_EVENT_MIS[LOWIFG] Bits */
#define ADC12_GEN_EVENT_MIS_LOWIFG_OFS           (3)                             /* !< LOWIFG Offset */
#define ADC12_GEN_EVENT_MIS_LOWIFG_MASK          ((uint32_t)0x00000008U)         /* !< Raw interrupt flag for the MEMRESx
                                                                                    result register being below than the
                                                                                    WCLOWx threshold of the window
                                                                                    comparator. This bit is reset to 0 by
                                                                                    IIDX read or when corresponding bit
                                                                                    in ICLR_EX is set to 1. */
#define ADC12_GEN_EVENT_MIS_LOWIFG_CLR           ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define ADC12_GEN_EVENT_MIS_LOWIFG_SET           ((uint32_t)0x00000008U)         /* !< Interrupt is pending. */
/* ADC12_GEN_EVENT_MIS[HIGHIFG] Bits */
#define ADC12_GEN_EVENT_MIS_HIGHIFG_OFS          (2)                             /* !< HIGHIFG Offset */
#define ADC12_GEN_EVENT_MIS_HIGHIFG_MASK         ((uint32_t)0x00000004U)         /* !< Raw interrupt flag for the MEMRESx
                                                                                    result register being higher than the
                                                                                    WCHIGHx threshold of the window
                                                                                    comparator. This bit is reset to 0 by
                                                                                    IIDX read or when corresponding bit
                                                                                    in ICLR_EX is set to 1. */
#define ADC12_GEN_EVENT_MIS_HIGHIFG_CLR          ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define ADC12_GEN_EVENT_MIS_HIGHIFG_SET          ((uint32_t)0x00000004U)         /* !< Interrupt is pending. */
/* ADC12_GEN_EVENT_MIS[MEMRESIFG0] Bits */
#define ADC12_GEN_EVENT_MIS_MEMRESIFG0_OFS       (8)                             /* !< MEMRESIFG0 Offset */
#define ADC12_GEN_EVENT_MIS_MEMRESIFG0_MASK      ((uint32_t)0x00000100U)         /* !< Raw interrupt status for MEMRES0.
                                                                                    This bit is set to 1 when MEMRES0 is
                                                                                    loaded with a new conversion result.
                                                                                    Reading MEMRES0 register will clear
                                                                                    this bit, or when the corresponding
                                                                                    bit in ICLR is set to 1 */
#define ADC12_GEN_EVENT_MIS_MEMRESIFG0_CLR       ((uint32_t)0x00000000U)         /* !< No new data ready. */
#define ADC12_GEN_EVENT_MIS_MEMRESIFG0_SET       ((uint32_t)0x00000100U)         /* !< A new data is ready to be read. */

/* ADC12_GEN_EVENT_ISET Bits */
/* ADC12_GEN_EVENT_ISET[INIFG] Bits */
#define ADC12_GEN_EVENT_ISET_INIFG_OFS           (4)                             /* !< INIFG Offset */
#define ADC12_GEN_EVENT_ISET_INIFG_MASK          ((uint32_t)0x00000010U)         /* !< Mask INIFG in MIS_EX register. */
#define ADC12_GEN_EVENT_ISET_INIFG_NO_EFFECT     ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define ADC12_GEN_EVENT_ISET_INIFG_SET           ((uint32_t)0x00000010U)         /* !< Interrupt is pending. */
/* ADC12_GEN_EVENT_ISET[LOWIFG] Bits */
#define ADC12_GEN_EVENT_ISET_LOWIFG_OFS          (3)                             /* !< LOWIFG Offset */
#define ADC12_GEN_EVENT_ISET_LOWIFG_MASK         ((uint32_t)0x00000008U)         /* !< Raw interrupt flag for the MEMRESx
                                                                                    result register being below than the
                                                                                    WCLOWx threshold of the window
                                                                                    comparator. This bit is reset to 0 by
                                                                                    IIDX read or when corresponding bit
                                                                                    in ICLR_EX is set to 1. */
#define ADC12_GEN_EVENT_ISET_LOWIFG_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define ADC12_GEN_EVENT_ISET_LOWIFG_SET          ((uint32_t)0x00000008U)         /* !< Interrupt is pending. */
/* ADC12_GEN_EVENT_ISET[HIGHIFG] Bits */
#define ADC12_GEN_EVENT_ISET_HIGHIFG_OFS         (2)                             /* !< HIGHIFG Offset */
#define ADC12_GEN_EVENT_ISET_HIGHIFG_MASK        ((uint32_t)0x00000004U)         /* !< Raw interrupt flag for the MEMRESx
                                                                                    result register being higher than the
                                                                                    WCHIGHx threshold of the window
                                                                                    comparator. This bit is reset to 0 by
                                                                                    IIDX read or when corresponding bit
                                                                                    in ICLR_EX is set to 1. */
#define ADC12_GEN_EVENT_ISET_HIGHIFG_NO_EFFECT   ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define ADC12_GEN_EVENT_ISET_HIGHIFG_SET         ((uint32_t)0x00000004U)         /* !< Interrupt is pending. */
/* ADC12_GEN_EVENT_ISET[MEMRESIFG0] Bits */
#define ADC12_GEN_EVENT_ISET_MEMRESIFG0_OFS      (8)                             /* !< MEMRESIFG0 Offset */
#define ADC12_GEN_EVENT_ISET_MEMRESIFG0_MASK     ((uint32_t)0x00000100U)         /* !< Raw interrupt status for MEMRES0.
                                                                                    This bit is set to 1 when MEMRES0 is
                                                                                    loaded with a new conversion result.
                                                                                    Reading MEMRES0 register will clear
                                                                                    this bit, or when the corresponding
                                                                                    bit in ICLR is set to 1 */
#define ADC12_GEN_EVENT_ISET_MEMRESIFG0_NO_EFFECT ((uint32_t)0x00000000U)         /* !< No new data ready. */
#define ADC12_GEN_EVENT_ISET_MEMRESIFG0_SET      ((uint32_t)0x00000100U)         /* !< A new data is ready to be read. */

