TexasInstruments/mspm0-sdk/source/ti/devices/msp/peripherals/hw_adc12.h
/* ADC12_CTL0 Bits */
/* ADC12_CTL0[ENC] Bits */
#define ADC12_CTL0_ENC_OFS                       (0)                             /* !< ENC Offset */
#define ADC12_CTL0_ENC_MASK                      ((uint32_t)0x00000001U)         /* !< Enable conversion */
#define ADC12_CTL0_ENC_OFF                       ((uint32_t)0x00000000U)         /* !< Conversion disabled. ENC change
                                                                                    from ON to OFF will abort single or
                                                                                    repeat sequence on a MEMCTLx
                                                                                    boundary. The current conversion will
                                                                                    finish and result stored in
                                                                                    corresponding MEMRESx. */
#define ADC12_CTL0_ENC_ON                        ((uint32_t)0x00000001U)         /* !< Conversion enabled. ADC sequencer
                                                                                    waits for valid trigger (software or
                                                                                    hardware). */
/* ADC12_CTL0[PWRDN] Bits */
#define ADC12_CTL0_PWRDN_OFS                     (16)                            /* !< PWRDN Offset */
#define ADC12_CTL0_PWRDN_MASK                    ((uint32_t)0x00010000U)         /* !< Power down policy */
#define ADC12_CTL0_PWRDN_AUTO                    ((uint32_t)0x00000000U)         /* !< ADC is powered down on completion
                                                                                    of a conversion if there is no
                                                                                    pending trigger */
#define ADC12_CTL0_PWRDN_MANUAL                  ((uint32_t)0x00010000U)         /* !< ADC remains powered on as long as
                                                                                    it is enabled through software. */
/* ADC12_CTL0[SCLKDIV] Bits */
#define ADC12_CTL0_SCLKDIV_OFS                   (24)                            /* !< SCLKDIV Offset */
#define ADC12_CTL0_SCLKDIV_MASK                  ((uint32_t)0x07000000U)         /* !< Sample clock divider */
#define ADC12_CTL0_SCLKDIV_DIV_BY_1              ((uint32_t)0x00000000U)         /* !< Do not divide clock source */
#define ADC12_CTL0_SCLKDIV_DIV_BY_2              ((uint32_t)0x01000000U)         /* !< Divide clock source by 2 */
#define ADC12_CTL0_SCLKDIV_DIV_BY_4              ((uint32_t)0x02000000U)         /* !< Divide clock source by 4 */
#define ADC12_CTL0_SCLKDIV_DIV_BY_8              ((uint32_t)0x03000000U)         /* !< Divide clock source by 8 */
#define ADC12_CTL0_SCLKDIV_DIV_BY_16             ((uint32_t)0x04000000U)         /* !< Divide clock source by 16 */
#define ADC12_CTL0_SCLKDIV_DIV_BY_24             ((uint32_t)0x05000000U)         /* !< Divide clock source by 24 */
#define ADC12_CTL0_SCLKDIV_DIV_BY_32             ((uint32_t)0x06000000U)         /* !< Divide clock source by 32 */
#define ADC12_CTL0_SCLKDIV_DIV_BY_48             ((uint32_t)0x07000000U)         /* !< Divide clock source by 48 */

/* ADC12_CTL1 Bits */
/* ADC12_CTL1[TRIGSRC] Bits */
#define ADC12_CTL1_TRIGSRC_OFS                   (0)                             /* !< TRIGSRC Offset */
#define ADC12_CTL1_TRIGSRC_MASK                  ((uint32_t)0x00000001U)         /* !< Sample trigger source */
#define ADC12_CTL1_TRIGSRC_SOFTWARE              ((uint32_t)0x00000000U)         /* !< Software trigger */
#define ADC12_CTL1_TRIGSRC_EVENT                 ((uint32_t)0x00000001U)         /* !< Hardware event trigger */
/* ADC12_CTL1[SC] Bits */
#define ADC12_CTL1_SC_OFS                        (8)                             /* !< SC Offset */
#define ADC12_CTL1_SC_MASK                       ((uint32_t)0x00000100U)         /* !< Start of conversion */
#define ADC12_CTL1_SC_STOP                       ((uint32_t)0x00000000U)         /* !< When SAMPMODE is set to MANUAL,
                                                                                    clearing this bit will end the sample
                                                                                    phase and the conversion phase will
                                                                                    start. When SAMPMODE is set to AUTO,
                                                                                    writing 0 has no effect. */
#define ADC12_CTL1_SC_START                      ((uint32_t)0x00000100U)         /* !< When SAMPMODE is set to MANUAL,
                                                                                    setting this bit will start the
                                                                                    sample phase. Sample phase will last
                                                                                    as long as this bit is set.  When
                                                                                    SAMPMODE is set to AUTO, setting this
                                                                                    bit will trigger the timer based
                                                                                    sample time. */
/* ADC12_CTL1[CONSEQ] Bits */
#define ADC12_CTL1_CONSEQ_OFS                    (16)                            /* !< CONSEQ Offset */
#define ADC12_CTL1_CONSEQ_MASK                   ((uint32_t)0x00030000U)         /* !< Conversion sequence mode */
#define ADC12_CTL1_CONSEQ_SINGLE                 ((uint32_t)0x00000000U)         /* !< ADC channel in MEMCTLx pointed by
                                                                                    STARTADD will be converted once */
#define ADC12_CTL1_CONSEQ_SEQUENCE               ((uint32_t)0x00010000U)         /* !< ADC channel sequence pointed by
                                                                                    STARTADD and ENDADD will be converted
                                                                                    once */
#define ADC12_CTL1_CONSEQ_REPEATSINGLE           ((uint32_t)0x00020000U)         /* !< ADC channel in MEMCTLx pointed by
                                                                                    STARTADD will be converted repeatedly */
#define ADC12_CTL1_CONSEQ_REPEATSEQUENCE         ((uint32_t)0x00030000U)         /* !< ADC channel sequence pointed by
                                                                                    STARTADD and ENDADD will be converted
                                                                                    repeatedly */
/* ADC12_CTL1[SAMPMODE] Bits */
#define ADC12_CTL1_SAMPMODE_OFS                  (20)                            /* !< SAMPMODE Offset */
#define ADC12_CTL1_SAMPMODE_MASK                 ((uint32_t)0x00100000U)         /* !< Sample mode. This bit selects the
                                                                                    source of the sampling signal.
                                                                                    MANUAL option is not valid when
                                                                                    TRIGSRC is selected as hardware event
                                                                                    trigger. */
#define ADC12_CTL1_SAMPMODE_AUTO                 ((uint32_t)0x00000000U)         /* !< Sample timer high phase is used as
                                                                                    sample signal */
#define ADC12_CTL1_SAMPMODE_MANUAL               ((uint32_t)0x00100000U)         /* !< Software trigger is used as sample
                                                                                    signal */
/* ADC12_CTL1[AVGN] Bits */
#define ADC12_CTL1_AVGN_OFS                      (24)                            /* !< AVGN Offset */
#define ADC12_CTL1_AVGN_MASK                     ((uint32_t)0x07000000U)         /* !< Hardware averager numerator.
                                                                                    Selects number of conversions to
                                                                                    accumulate for current MEMCTLx and
                                                                                    then it is divided by AVGD. Result
                                                                                    will be stored in MEMRESx. */
#define ADC12_CTL1_AVGN_DISABLE                  ((uint32_t)0x00000000U)         /* !< Disables averager */
#define ADC12_CTL1_AVGN_AVG_2                    ((uint32_t)0x01000000U)         /* !< Averages 2 conversions before
                                                                                    storing in MEMRESx register */
#define ADC12_CTL1_AVGN_AVG_4                    ((uint32_t)0x02000000U)         /* !< Averages 4 conversions before
                                                                                    storing in MEMRESx register */
#define ADC12_CTL1_AVGN_AVG_8                    ((uint32_t)0x03000000U)         /* !< Averages 8 conversions before
                                                                                    storing in MEMRESx register */
#define ADC12_CTL1_AVGN_AVG_16                   ((uint32_t)0x04000000U)         /* !< Averages 16 conversions before
                                                                                    storing in MEMRESx register */
#define ADC12_CTL1_AVGN_AVG_32                   ((uint32_t)0x05000000U)         /* !< Averages 32 conversions before
                                                                                    storing in MEMRESx register */
#define ADC12_CTL1_AVGN_AVG_64                   ((uint32_t)0x06000000U)         /* !< Averages 64 conversions before
                                                                                    storing in MEMRESx register */
#define ADC12_CTL1_AVGN_AVG_128                  ((uint32_t)0x07000000U)         /* !< Averages 128 conversions before
                                                                                    storing in MEMRESx register */
/* ADC12_CTL1[AVGD] Bits */
#define ADC12_CTL1_AVGD_OFS                      (28)                            /* !< AVGD Offset */
#define ADC12_CTL1_AVGD_MASK                     ((uint32_t)0x70000000U)         /* !< Hardware averager denominator. The
                                                                                    number to divide the accumulated
                                                                                    value by (this is a shift). Note
                                                                                    result register is maximum of 16-bits
                                                                                    long so if not shifted appropriately
                                                                                    result will be truncated. */
#define ADC12_CTL1_AVGD_SHIFT0                   ((uint32_t)0x00000000U)         /* !< No shift */
#define ADC12_CTL1_AVGD_SHIFT1                   ((uint32_t)0x10000000U)         /* !< 1 bit shift */
#define ADC12_CTL1_AVGD_SHIFT2                   ((uint32_t)0x20000000U)         /* !< 2 bit shift */
#define ADC12_CTL1_AVGD_SHIFT3                   ((uint32_t)0x30000000U)         /* !< 3 bit shift */
#define ADC12_CTL1_AVGD_SHIFT4                   ((uint32_t)0x40000000U)         /* !< 4 bit shift */
#define ADC12_CTL1_AVGD_SHIFT5                   ((uint32_t)0x50000000U)         /* !< 5 bit shift */
#define ADC12_CTL1_AVGD_SHIFT6                   ((uint32_t)0x60000000U)         /* !< 6 bit shift */
#define ADC12_CTL1_AVGD_SHIFT7                   ((uint32_t)0x70000000U)         /* !< 7 bit shift */

