TexasInstruments/mspm0-sdk/source/ti/devices/msp/peripherals/hw_adc12.h
/* ADC12_CTL3 Bits */
/* ADC12_CTL3[ASCCHSEL] Bits */
#define ADC12_CTL3_ASCCHSEL_OFS                  (0)                             /* !< ASCCHSEL Offset */
#define ADC12_CTL3_ASCCHSEL_MASK                 ((uint32_t)0x0000001FU)         /* !< ASC channel select */
#define ADC12_CTL3_ASCCHSEL_CHAN_0               ((uint32_t)0x00000000U)         /* !< Selects channel 0 */
#define ADC12_CTL3_ASCCHSEL_CHAN_1               ((uint32_t)0x00000001U)         /* !< Selects channel 1 */
#define ADC12_CTL3_ASCCHSEL_CHAN_2               ((uint32_t)0x00000002U)         /* !< Selects channel 2 */
#define ADC12_CTL3_ASCCHSEL_CHAN_3               ((uint32_t)0x00000003U)         /* !< Selects channel 3 */
#define ADC12_CTL3_ASCCHSEL_CHAN_4               ((uint32_t)0x00000004U)         /* !< Selects channel 4 */
#define ADC12_CTL3_ASCCHSEL_CHAN_5               ((uint32_t)0x00000005U)         /* !< Selects channel 5 */
#define ADC12_CTL3_ASCCHSEL_CHAN_6               ((uint32_t)0x00000006U)         /* !< Selects channel 6 */
#define ADC12_CTL3_ASCCHSEL_CHAN_7               ((uint32_t)0x00000007U)         /* !< Selects channel 7 */
#define ADC12_CTL3_ASCCHSEL_CHAN_8               ((uint32_t)0x00000008U)         /* !< Selects channel 8 */
#define ADC12_CTL3_ASCCHSEL_CHAN_9               ((uint32_t)0x00000009U)         /* !< Selects channel 9 */
#define ADC12_CTL3_ASCCHSEL_CHAN_10              ((uint32_t)0x0000000AU)         /* !< Selects channel 10 */
#define ADC12_CTL3_ASCCHSEL_CHAN_11              ((uint32_t)0x0000000BU)         /* !< Selects channel 11 */
#define ADC12_CTL3_ASCCHSEL_CHAN_12              ((uint32_t)0x0000000CU)         /* !< Selects channel 12 */
#define ADC12_CTL3_ASCCHSEL_CHAN_13              ((uint32_t)0x0000000DU)         /* !< Selects channel 13 */
#define ADC12_CTL3_ASCCHSEL_CHAN_14              ((uint32_t)0x0000000EU)         /* !< Selects channel 14 */
#define ADC12_CTL3_ASCCHSEL_CHAN_15              ((uint32_t)0x0000000FU)         /* !< Selects channel 15 */
#define ADC12_CTL3_ASCCHSEL_CHAN_16              ((uint32_t)0x00000010U)         /* !< Selects channel 16 */
#define ADC12_CTL3_ASCCHSEL_CHAN_17              ((uint32_t)0x00000011U)         /* !< Selects channel 17 */
#define ADC12_CTL3_ASCCHSEL_CHAN_18              ((uint32_t)0x00000012U)         /* !< Selects channel 18 */
#define ADC12_CTL3_ASCCHSEL_CHAN_19              ((uint32_t)0x00000013U)         /* !< Selects channel 19 */
#define ADC12_CTL3_ASCCHSEL_CHAN_20              ((uint32_t)0x00000014U)         /* !< Selects channel 20 */
#define ADC12_CTL3_ASCCHSEL_CHAN_21              ((uint32_t)0x00000015U)         /* !< Selects channel 21 */
#define ADC12_CTL3_ASCCHSEL_CHAN_22              ((uint32_t)0x00000016U)         /* !< Selects channel 22 */
#define ADC12_CTL3_ASCCHSEL_CHAN_23              ((uint32_t)0x00000017U)         /* !< Selects channel 23 */
#define ADC12_CTL3_ASCCHSEL_CHAN_24              ((uint32_t)0x00000018U)         /* !< Selects channel 24 */
#define ADC12_CTL3_ASCCHSEL_CHAN_25              ((uint32_t)0x00000019U)         /* !< Selects channel 25 */
#define ADC12_CTL3_ASCCHSEL_CHAN_26              ((uint32_t)0x0000001AU)         /* !< Selects channel 26 */
#define ADC12_CTL3_ASCCHSEL_CHAN_27              ((uint32_t)0x0000001BU)         /* !< Selects channel 27 */
#define ADC12_CTL3_ASCCHSEL_CHAN_28              ((uint32_t)0x0000001CU)         /* !< Selects channel 28 */
#define ADC12_CTL3_ASCCHSEL_CHAN_29              ((uint32_t)0x0000001DU)         /* !< Selects channel 29 */
#define ADC12_CTL3_ASCCHSEL_CHAN_30              ((uint32_t)0x0000001EU)         /* !< Selects channel 30 */
#define ADC12_CTL3_ASCCHSEL_CHAN_31              ((uint32_t)0x0000001FU)         /* !< Selects channel 31 */
/* ADC12_CTL3[ASCSTIME] Bits */
#define ADC12_CTL3_ASCSTIME_OFS                  (8)                             /* !< ASCSTIME Offset */
#define ADC12_CTL3_ASCSTIME_MASK                 ((uint32_t)0x00000100U)         /* !< ASC sample time compare value
                                                                                    select. This is used to select
                                                                                    between SCOMP0 and SCOMP1 registers
                                                                                    for ASC operation. */
#define ADC12_CTL3_ASCSTIME_SEL_SCOMP0           ((uint32_t)0x00000000U)         /* !< Select SCOMP0 */
#define ADC12_CTL3_ASCSTIME_SEL_SCOMP1           ((uint32_t)0x00000100U)         /* !< Select SCOMP1 */
/* ADC12_CTL3[ASCVRSEL] Bits */
#define ADC12_CTL3_ASCVRSEL_OFS                  (12)                            /* !< ASCVRSEL Offset */
#define ADC12_CTL3_ASCVRSEL_MASK                 ((uint32_t)0x00003000U)         /* !< Selects voltage reference for ASC
                                                                                    operation. VEREFM must be connected
                                                                                    to on-board ground when external
                                                                                    reference option is selected. Note:
                                                                                    Writing value 0x3 defaults to INTREF. */
#define ADC12_CTL3_ASCVRSEL_VDDA                 ((uint32_t)0x00000000U)         /* !< VDDA reference. */
#define ADC12_CTL3_ASCVRSEL_EXTREF               ((uint32_t)0x00001000U)         /* !< EXTREF pin reference. */
#define ADC12_CTL3_ASCVRSEL_INTREF               ((uint32_t)0x00002000U)         /* !< Internal reference. */

/* ADC12_CLKFREQ Bits */
/* ADC12_CLKFREQ[FRANGE] Bits */
#define ADC12_CLKFREQ_FRANGE_OFS                 (0)                             /* !< FRANGE Offset */
#define ADC12_CLKFREQ_FRANGE_MASK                ((uint32_t)0x00000007U)         /* !< Frequency Range. */
#define ADC12_CLKFREQ_FRANGE_RANGE1TO4           ((uint32_t)0x00000000U)         /* !< 1 to 4 MHz */
#define ADC12_CLKFREQ_FRANGE_RANGE4TO8           ((uint32_t)0x00000001U)         /* !< >4 to 8 MHz */
#define ADC12_CLKFREQ_FRANGE_RANGE8TO16          ((uint32_t)0x00000002U)         /* !< >8 to 16 MHz */
#define ADC12_CLKFREQ_FRANGE_RANGE16TO20         ((uint32_t)0x00000003U)         /* !< >16 to 20 MHz */
#define ADC12_CLKFREQ_FRANGE_RANGE20TO24         ((uint32_t)0x00000004U)         /* !< >20 to 24 MHz */
#define ADC12_CLKFREQ_FRANGE_RANGE24TO32         ((uint32_t)0x00000005U)         /* !< >24 to 32 MHz */
#define ADC12_CLKFREQ_FRANGE_RANGE32TO40         ((uint32_t)0x00000006U)         /* !< >32 to 40 MHz */
#define ADC12_CLKFREQ_FRANGE_RANGE40TO48         ((uint32_t)0x00000007U)         /* !< >40 to 48 MHz */

