TexasInstruments/mspm0-sdk/source/ti/devices/msp/peripherals/hw_adc12.h
/* ADC12_SCOMP0 Bits */
/* ADC12_SCOMP0[VAL] Bits */
#define ADC12_SCOMP0_VAL_OFS                     (0)                             /* !< VAL Offset */
#define ADC12_SCOMP0_VAL_MASK                    ((uint32_t)0x000003FFU)         /* !< Specifies the number of sample
                                                                                    clocks. When VAL = 0 or 1, number of
                                                                                    sample clocks = Sample clock divide
                                                                                    value. When VAL > 1, number of sample
                                                                                    clocks = VAL x Sample clock divide
                                                                                    value. Note: Sample clock divide
                                                                                    value is not the value written to
                                                                                    SCLKDIV but the actual divide value
                                                                                    (SCLKDIV = 2 implies divide value is
                                                                                    4). Example: VAL = 4, SCLKDIV = 3
                                                                                    implies 32 sample clock cycles. */

/* ADC12_SCOMP1 Bits */
/* ADC12_SCOMP1[VAL] Bits */
#define ADC12_SCOMP1_VAL_OFS                     (0)                             /* !< VAL Offset */
#define ADC12_SCOMP1_VAL_MASK                    ((uint32_t)0x000003FFU)         /* !< Specifies the number of sample
                                                                                    clocks. When VAL = 0 or 1, number of
                                                                                    sample clocks = Sample clock divide
                                                                                    value. When VAL > 1, number of sample
                                                                                    clocks = VAL x Sample clock divide
                                                                                    value. Note: Sample clock divide
                                                                                    value is not the value written to
                                                                                    SCLKDIV but the actual divide value
                                                                                    (SCLKDIV = 2 implies divide value is
                                                                                    4). Example: VAL = 4, SCLKDIV = 3
                                                                                    implies 32 sample clock cycles. */

/* ADC12_REFCFG Bits */
/* ADC12_REFCFG[REFEN] Bits */
#define ADC12_REFCFG_REFEN_OFS                   (0)                             /* !< REFEN Offset */
#define ADC12_REFCFG_REFEN_MASK                  ((uint32_t)0x00000001U)         /* !< Reference buffer enable */
#define ADC12_REFCFG_REFEN_DISABLE               ((uint32_t)0x00000000U)         /* !< Disable */
#define ADC12_REFCFG_REFEN_ENABLE                ((uint32_t)0x00000001U)         /* !< Enable */
/* ADC12_REFCFG[REFVSEL] Bits */
#define ADC12_REFCFG_REFVSEL_OFS                 (1)                             /* !< REFVSEL Offset */
#define ADC12_REFCFG_REFVSEL_MASK                ((uint32_t)0x00000002U)         /* !< Configures reference buffer output
                                                                                    voltage */
#define ADC12_REFCFG_REFVSEL_V2P5                ((uint32_t)0x00000000U)         /* !< Reference buffer generates 2.5 V
                                                                                    output */
#define ADC12_REFCFG_REFVSEL_V1P4                ((uint32_t)0x00000002U)         /* !< Reference buffer generates 1.4 V
                                                                                    output */
/* ADC12_REFCFG[IBPROG] Bits */
#define ADC12_REFCFG_IBPROG_OFS                  (3)                             /* !< IBPROG Offset */
#define ADC12_REFCFG_IBPROG_MASK                 ((uint32_t)0x00000018U)         /* !< Configures reference buffer bias
                                                                                    current output value */
#define ADC12_REFCFG_IBPROG_VAL0                 ((uint32_t)0x00000000U)         /* !< 1uA */
#define ADC12_REFCFG_IBPROG_VAL1                 ((uint32_t)0x00000008U)         /* !< 0.5uA */
#define ADC12_REFCFG_IBPROG_VAL2                 ((uint32_t)0x00000010U)         /* !< 2uA */
#define ADC12_REFCFG_IBPROG_VAL3                 ((uint32_t)0x00000018U)         /* !< 0.67uA */

/* ADC12_WCLOW Bits */
/* ADC12_WCLOW[DATA] Bits */
#define ADC12_WCLOW_DATA_OFS                     (0)                             /* !< DATA Offset */
#define ADC12_WCLOW_DATA_MASK                    ((uint32_t)0x0000FFFFU)         /* !< If DF = 0, unsigned binary format
                                                                                    has to be used.  The value based on
                                                                                    the resolution has to be right
                                                                                    aligned with the MSB on the left. For
                                                                                    10-bits and 8-bits resolution, unused
                                                                                    bits have to be 0s.  If DF = 1,
                                                                                    2s-complement format has to be used.
                                                                                    The value based on the resolution has
                                                                                    to be left aligned with the LSB on
                                                                                    the right.  For 10-bits and 8-bits
                                                                                    resolution, unused bits have to be
                                                                                    0s. */

/* ADC12_WCHIGH Bits */
/* ADC12_WCHIGH[DATA] Bits */
#define ADC12_WCHIGH_DATA_OFS                    (0)                             /* !< DATA Offset */
#define ADC12_WCHIGH_DATA_MASK                   ((uint32_t)0x0000FFFFU)         /* !< If DF = 0, unsigned binary format
                                                                                    has to be used. The threshold value
                                                                                    has to be right aligned, with the MSB
                                                                                    on the left. For 10-bits and 8-bits
                                                                                    resolution, unused bit have to be 0s.
                                                                                    If DF = 1, 2s-complement format has
                                                                                    to be used. The value based on the
                                                                                    resolution has to be left aligned
                                                                                    with the LSB on the right.  For
                                                                                    10-bits and 8-bits resolution, unused
                                                                                    bit have to be 0s. */

/* ADC12_ULLMEM_FIFODATA Bits */
/* ADC12_ULLMEM_FIFODATA[DATA] Bits */
#define ADC12_ULLMEM_FIFODATA_DATA_OFS           (0)                             /* !< DATA Offset */
#define ADC12_ULLMEM_FIFODATA_DATA_MASK          ((uint32_t)0xFFFFFFFFU)         /* !< Read from this data field returns
                                                                                    the ADC sample from FIFO. */

/* ADC12_ASCRES Bits */
/* ADC12_ASCRES[DATA] Bits */
#define ADC12_ASCRES_DATA_OFS                    (0)                             /* !< DATA Offset */
#define ADC12_ASCRES_DATA_MASK                   ((uint32_t)0x0000FFFFU)         /* !< Result of ADC ad-hoc single
                                                                                    conversion. If DF = 0, unsigned
                                                                                    binary: The conversion result is
                                                                                    right aligned. In 10 and 8 bit modes,
                                                                                    the unused MSB bits are forced to 0.
                                                                                    If DF = 1, 2s-complement format: The
                                                                                    conversion result is left aligned. In
                                                                                    10 and 8 bit modes, the unused LSB
                                                                                    bits are forced to 0. The data is
                                                                                    stored in the right-justified format
                                                                                    and is converted to the
                                                                                    left-justified 2s-complement format
                                                                                    during read back. */

/* ADC12_MEMCTL Bits */
/* ADC12_MEMCTL[CHANSEL] Bits */
#define ADC12_MEMCTL_CHANSEL_OFS                 (0)                             /* !< CHANSEL Offset */
#define ADC12_MEMCTL_CHANSEL_MASK                ((uint32_t)0x0000001FU)         /* !< Input channel select. */
#define ADC12_MEMCTL_CHANSEL_CHAN_0              ((uint32_t)0x00000000U)         /* !< Selects channel 0 */
#define ADC12_MEMCTL_CHANSEL_CHAN_1              ((uint32_t)0x00000001U)         /* !< Selects channel 1 */
#define ADC12_MEMCTL_CHANSEL_CHAN_2              ((uint32_t)0x00000002U)         /* !< Selects channel 2 */
#define ADC12_MEMCTL_CHANSEL_CHAN_3              ((uint32_t)0x00000003U)         /* !< Selects channel 3 */
#define ADC12_MEMCTL_CHANSEL_CHAN_4              ((uint32_t)0x00000004U)         /* !< Selects channel 4 */
#define ADC12_MEMCTL_CHANSEL_CHAN_5              ((uint32_t)0x00000005U)         /* !< Selects channel 5 */
#define ADC12_MEMCTL_CHANSEL_CHAN_6              ((uint32_t)0x00000006U)         /* !< Selects channel 6 */
#define ADC12_MEMCTL_CHANSEL_CHAN_7              ((uint32_t)0x00000007U)         /* !< Selects channel 7 */
#define ADC12_MEMCTL_CHANSEL_CHAN_8              ((uint32_t)0x00000008U)         /* !< Selects channel 8 */
#define ADC12_MEMCTL_CHANSEL_CHAN_9              ((uint32_t)0x00000009U)         /* !< Selects channel 9 */
#define ADC12_MEMCTL_CHANSEL_CHAN_10             ((uint32_t)0x0000000AU)         /* !< Selects channel 10 */
#define ADC12_MEMCTL_CHANSEL_CHAN_11             ((uint32_t)0x0000000BU)         /* !< Selects channel 11 */
#define ADC12_MEMCTL_CHANSEL_CHAN_12             ((uint32_t)0x0000000CU)         /* !< Selects channel 12 */
#define ADC12_MEMCTL_CHANSEL_CHAN_13             ((uint32_t)0x0000000DU)         /* !< Selects channel 13 */
#define ADC12_MEMCTL_CHANSEL_CHAN_14             ((uint32_t)0x0000000EU)         /* !< Selects channel 14 */
#define ADC12_MEMCTL_CHANSEL_CHAN_15             ((uint32_t)0x0000000FU)         /* !< Selects channel 15 */
#define ADC12_MEMCTL_CHANSEL_CHAN_16             ((uint32_t)0x00000010U)         /* !< Selects channel 16 */
#define ADC12_MEMCTL_CHANSEL_CHAN_17             ((uint32_t)0x00000011U)         /* !< Selects channel 17 */
#define ADC12_MEMCTL_CHANSEL_CHAN_18             ((uint32_t)0x00000012U)         /* !< Selects channel 18 */
#define ADC12_MEMCTL_CHANSEL_CHAN_19             ((uint32_t)0x00000013U)         /* !< Selects channel 19 */
#define ADC12_MEMCTL_CHANSEL_CHAN_20             ((uint32_t)0x00000014U)         /* !< Selects channel 20 */
#define ADC12_MEMCTL_CHANSEL_CHAN_21             ((uint32_t)0x00000015U)         /* !< Selects channel 21 */
#define ADC12_MEMCTL_CHANSEL_CHAN_22             ((uint32_t)0x00000016U)         /* !< Selects channel 22 */
#define ADC12_MEMCTL_CHANSEL_CHAN_23             ((uint32_t)0x00000017U)         /* !< Selects channel 23 */
#define ADC12_MEMCTL_CHANSEL_CHAN_24             ((uint32_t)0x00000018U)         /* !< Selects channel 24 */
#define ADC12_MEMCTL_CHANSEL_CHAN_25             ((uint32_t)0x00000019U)         /* !< Selects channel 25 */
#define ADC12_MEMCTL_CHANSEL_CHAN_26             ((uint32_t)0x0000001AU)         /* !< Selects channel 26 */
#define ADC12_MEMCTL_CHANSEL_CHAN_27             ((uint32_t)0x0000001BU)         /* !< Selects channel 27 */
#define ADC12_MEMCTL_CHANSEL_CHAN_28             ((uint32_t)0x0000001CU)         /* !< Selects channel 28 */
#define ADC12_MEMCTL_CHANSEL_CHAN_29             ((uint32_t)0x0000001DU)         /* !< Selects channel 29 */
#define ADC12_MEMCTL_CHANSEL_CHAN_30             ((uint32_t)0x0000001EU)         /* !< Selects channel 30 */
#define ADC12_MEMCTL_CHANSEL_CHAN_31             ((uint32_t)0x0000001FU)         /* !< Selects channel 31 */
/* ADC12_MEMCTL[TRIG] Bits */
#define ADC12_MEMCTL_TRIG_OFS                    (24)                            /* !< TRIG Offset */
#define ADC12_MEMCTL_TRIG_MASK                   ((uint32_t)0x01000000U)         /* !< Trigger policy. Indicates if a
                                                                                    trigger will be needed to step to the
                                                                                    next MEMCTL in the sequence or to
                                                                                    perform next conversion in the case
                                                                                    of repeat single channel conversions. */
#define ADC12_MEMCTL_TRIG_AUTO_NEXT              ((uint32_t)0x00000000U)         /* !< Next conversion is automatic */
#define ADC12_MEMCTL_TRIG_TRIGGER_NEXT           ((uint32_t)0x01000000U)         /* !< Next conversion requires a trigger */
/* ADC12_MEMCTL[VRSEL] Bits */
#define ADC12_MEMCTL_VRSEL_OFS                   (8)                             /* !< VRSEL Offset */
#define ADC12_MEMCTL_VRSEL_MASK                  ((uint32_t)0x00000300U)         /* !< Voltage reference selection. VEREFM
                                                                                    must be connected to on-board ground
                                                                                    when external reference option is
                                                                                    selected. Note: Writing value 0x3
                                                                                    defaults to INTREF. */
#define ADC12_MEMCTL_VRSEL_VDDA                  ((uint32_t)0x00000000U)         /* !< VDDA reference */
#define ADC12_MEMCTL_VRSEL_EXTREF                ((uint32_t)0x00000100U)         /* !< External reference from pin */
#define ADC12_MEMCTL_VRSEL_INTREF                ((uint32_t)0x00000200U)         /* !< Internal reference */
/* ADC12_MEMCTL[WINCOMP] Bits */
#define ADC12_MEMCTL_WINCOMP_OFS                 (28)                            /* !< WINCOMP Offset */
#define ADC12_MEMCTL_WINCOMP_MASK                ((uint32_t)0x10000000U)         /* !< Enable window comparator. */
#define ADC12_MEMCTL_WINCOMP_DISABLE             ((uint32_t)0x00000000U)         /* !< Disable */
#define ADC12_MEMCTL_WINCOMP_ENABLE              ((uint32_t)0x10000000U)         /* !< Enable */
/* ADC12_MEMCTL[BCSEN] Bits */
#define ADC12_MEMCTL_BCSEN_OFS                   (20)                            /* !< BCSEN Offset */
#define ADC12_MEMCTL_BCSEN_MASK                  ((uint32_t)0x00100000U)         /* !< Enable burn out current source. */
#define ADC12_MEMCTL_BCSEN_DISABLE               ((uint32_t)0x00000000U)         /* !< Disable */
#define ADC12_MEMCTL_BCSEN_ENABLE                ((uint32_t)0x00100000U)         /* !< Enable */
/* ADC12_MEMCTL[AVGEN] Bits */
#define ADC12_MEMCTL_AVGEN_OFS                   (16)                            /* !< AVGEN Offset */
#define ADC12_MEMCTL_AVGEN_MASK                  ((uint32_t)0x00010000U)         /* !< Enable hardware averaging. */
#define ADC12_MEMCTL_AVGEN_DISABLE               ((uint32_t)0x00000000U)         /* !< Averaging disabled. */
#define ADC12_MEMCTL_AVGEN_ENABLE                ((uint32_t)0x00010000U)         /* !< Averaging enabled. */
/* ADC12_MEMCTL[STIME] Bits */
#define ADC12_MEMCTL_STIME_OFS                   (12)                            /* !< STIME Offset */
#define ADC12_MEMCTL_STIME_MASK                  ((uint32_t)0x00001000U)         /* !< Selects the source of sample timer
                                                                                    period between SCOMP0 and SCOMP1. */
#define ADC12_MEMCTL_STIME_SEL_SCOMP0            ((uint32_t)0x00000000U)         /* !< Select SCOMP0 */
#define ADC12_MEMCTL_STIME_SEL_SCOMP1            ((uint32_t)0x00001000U)         /* !< Select SCOMP1 */

/* ADC12_ULLMEM_MEMRES Bits */
/* ADC12_ULLMEM_MEMRES[DATA] Bits */
#define ADC12_ULLMEM_MEMRES_DATA_OFS             (0)                             /* !< DATA Offset */
#define ADC12_ULLMEM_MEMRES_DATA_MASK            ((uint32_t)0x0000FFFFU)         /* !< MEMRES result register. If DF = 0,
                                                                                    unsigned binary: The conversion
                                                                                    results are right aligned. In 10 and
                                                                                    8 bit modes, the unused MSB bits are
                                                                                    forced to 0.  If DF = 1,
                                                                                    2s-complement format: The conversion
                                                                                    results are left aligned. In 10 and 8
                                                                                    bit modes, the unused LSB bits are
                                                                                    forced to 0. The data is stored in
                                                                                    the right-justified format and is
                                                                                    converted to the left-justified
                                                                                    2s-complement format during read
                                                                                    back. */

/* ADC12_STATUS Bits */
/* ADC12_STATUS[BUSY] Bits */
#define ADC12_STATUS_BUSY_OFS                    (0)                             /* !< BUSY Offset */
#define ADC12_STATUS_BUSY_MASK                   ((uint32_t)0x00000001U)         /* !< Busy. This bit indicates that an
                                                                                    active ADC sample or conversion
                                                                                    operation is in progress. */
#define ADC12_STATUS_BUSY_IDLE                   ((uint32_t)0x00000000U)         /* !< No ADC sampling or conversion in
                                                                                    progress. */
#define ADC12_STATUS_BUSY_ACTIVE                 ((uint32_t)0x00000001U)         /* !< ADC sampling or conversion is in
                                                                                    progress. */
/* ADC12_STATUS[REFBUFRDY] Bits */
#define ADC12_STATUS_REFBUFRDY_OFS               (1)                             /* !< REFBUFRDY Offset */
#define ADC12_STATUS_REFBUFRDY_MASK              ((uint32_t)0x00000002U)         /* !< Indicates reference buffer is
                                                                                    powered up and ready. */
#define ADC12_STATUS_REFBUFRDY_NOTREADY          ((uint32_t)0x00000000U)         /* !< Not ready */
#define ADC12_STATUS_REFBUFRDY_READY             ((uint32_t)0x00000002U)         /* !< Ready */
/* ADC12_STATUS[ASCACT] Bits */
#define ADC12_STATUS_ASCACT_OFS                  (2)                             /* !< ASCACT Offset */
#define ADC12_STATUS_ASCACT_MASK                 ((uint32_t)0x00000004U)         /* !< ASC active */
#define ADC12_STATUS_ASCACT_IDLE                 ((uint32_t)0x00000000U)         /* !< Idle or done */
#define ADC12_STATUS_ASCACT_ACTIVE               ((uint32_t)0x00000004U)         /* !< ASC active */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_adc12__include */
